<?php

namespace frontend\models;

use \yii\db\ActiveRecord;

class Customers extends ActiveRecord
{	
	public function behaviors()
	{
		return [
			'class' => DataExtractor::class,
		];
	}

	//---------------------------------------------------------------------------
	public static function tableName()
	//---------------------------------------------------------------------------
	{
		return '{{Customers}}';
	}

	//---------------------------------------------------------------------------
    public static function primaryKey()
	//---------------------------------------------------------------------------
    {
        return ['uid'];
    }

	//---------------------------------------------------------------------------
    public function rules()
	//---------------------------------------------------------------------------
    {
        return [
			[['uid'], 'string', 'max' => 36],
			[['code'], 'string', 'max' => 8],        
        ];
    }
	
	//---------------------------------------------------------------------------
    public function attributeLabels()
	//---------------------------------------------------------------------------
    {
        return [
            'uid' => 'GUID в 1С',
            'code' =>'Код элемента в 1С',                   
        ];
    }
	
	//---------------------------------------------------------------------------
    public static function findCustomer($uid)
	//---------------------------------------------------------------------------
    {
        return static::findOne($uid);
    }
	
	//---------------------------------------------------------------------------
	public function beforeSave($insert)
	//---------------------------------------------------------------------------
	{
		if(parent::beforeSave($insert))
		{ 
			//
			return true;
		}
		else
			return false;
	}
	
	
}
