<?php

namespace frontend\models;

use \yii\db\ActiveRecord;

class Vehicles extends ActiveRecord
{
	//---------------------------------------------------------------------------
	public static function tableName()
	//---------------------------------------------------------------------------
	{
		return '{{Vehicles}}';
	}

	//---------------------------------------------------------------------------
	public static function primaryKey()
	//---------------------------------------------------------------------------
	{
		return ['vin'];
	}

	//---------------------------------------------------------------------------
	public function rules()
	//---------------------------------------------------------------------------
	{
		return [
			[['vin'], 'string', 'max' => 17],
			[['registration_number'], 'string', 'max' => 10],
		];
	}

	//---------------------------------------------------------------------------
	public function attributeLabels()
	//---------------------------------------------------------------------------
	{
		return [
			'vin' => 'ВИН',
			'registration_number' => 'Государственный регистрационный номер',
		];
	}

	//---------------------------------------------------------------------------
	public static function findVehicle($vin)
	//---------------------------------------------------------------------------
	{
		return static::findOne($vin);
	}

	//---------------------------------------------------------------------------
	public function beforeSave($insert)
	//---------------------------------------------------------------------------
	{
		if (parent::beforeSave($insert)) {
			//
			return true;
		} else
			return false;
	}
}
